FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_Показатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БТ_Показатели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйМодуль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_ВидПоказателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапросаРасшифровки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_ТипРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_НаправлениеДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ЕдиницыИзмеренияПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойПоказатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйРасчетСПодразделениями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БТ_ВидыАналитики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимостьОтМетаданных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_СписокКонстантныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БТ_СписокКонстантныхЗначений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_Показатели/Ext/ManagerModule.bsl
Функция ВыполнитьРасчет(Выборка, ПодразделениеКомпании = Неопределено) Экспорт
	//Знач НачПериода,Знач КонПериода,Знач Показатель, Знач Организация=Неопределено) Экспорт
	Попытка
		Показатель = Выборка.Показатель;
		
		Если Ложь Тогда Показатель = Справочники.БТ_Показатели.ПустаяСсылка(); КонецЕсли;
		
		Если Показатель.ВидПоказателя=Перечисления.БТ_ВидПоказателя.Запрос Тогда
			
			Запрос=Новый Запрос();
			Запрос.Текст=Показатель.ТекстЗапроса;
			
			Для Каждого ТекПараметр Из Показатель.Параметры Цикл 
				
				Если Не ТекПараметр.ЭтоВыражение Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра,ТекПараметр.ЗначениеПараметра);
					
				Иначе
					
					ТекЗнач="";
					Выполнить("ТекЗнач="+ТекПараметр.ЗначениеПараметра);
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра,ТекЗнач);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="НачалоПериода" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, Выборка.ДатаНачалаРасчета);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="КонецПериода" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, Выборка.ДатаОкончанияРасчета);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="Организация" и не Выборка.Организация=Неопределено Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, Выборка.Организация);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра = "ПодразделениеКомпании" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, ПодразделениеКомпании);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Рез = Запрос.Выполнить().Выгрузить();
			
			ПоляГрупировки = "";
			Для каждого ТекСтр из Показатель.Аналитика Цикл
				
				ПоляГрупировки = ПоляГрупировки + ?(ПустаяСтрока(ПоляГрупировки),"",",") + ТекСтр.Аналитика.Наименование;
				
			КонецЦикла;
			
			Рез.Свернуть(ПоляГрупировки,Показатель.ЗначениеПоказателя);
			
			//Возврат Рез;
			Возврат Рез;//.Итог(Показатель.ЗначениеПоказателя);
			
		ИначеЕсли Показатель.ВидПоказателя=Перечисления.БТ_ВидПоказателя.Модуль Тогда
			
			СтрокаПараметров="";
			Сч=-1;
			
			Для Каждого ТекПараметр Из Показатель.Параметры Цикл 
				
				Сч=Сч+1;
				
				Если ТекПараметр.ИмяПараметра="НачПериода" Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"=Выборка.ДатаНачалаРасчета;";
					Выполнить(Строка);
					Продолжить;
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="КонПериода" Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"=Выборка.ДатаОкончанияРасчета;";
					Выполнить(Строка);
					Продолжить;
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="Организация" и не Выборка.Организация=Неопределено Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"=Выборка.Организация;";
					Выполнить(Строка);
					Продолжить;
					
				КонецЕсли;

				Если ТекПараметр.ЭтоВыражение Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"="+ТекПараметр.ЗначениеПараметра+";";
					СтрокаПараметров=СтрокаПараметров+Строка+"
					|";
					
				Иначе
					
					Строка=ТекПараметр.ИмяПараметра+"=Показатель.Параметры["+Сч+"].ЗначениеПараметра;";
					СтрокаПараметров=СтрокаПараметров+Строка+"
					|";
					
				КонецЕсли;
				
			КонецЦикла;
			
			//выполним модуль
			ТаблицаМодуля=Новый ТаблицаЗначений;
			Выполнить(СтрокаПараметров+Показатель.ПроизвольныйМодуль);
			Возврат ТаблицаМодуля.Итог(Показатель.ЗначениеПоказателя);
			
		КонецЕсли;
		
	Исключение
		
		Возврат ОписаниеОшибки();
		
	КонецПопытки;
КонецФункции

Функция ПроверитьНаСервере(ТекстЗапроса = Неопределено,Объект) Экспорт
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если Объект.ВидПоказателя=Перечисления.БТ_ВидПоказателя.Запрос или не ТекстЗапроса = Неопределено Тогда
		
		Если ПустаяСтрока(?(ТекстЗапроса = Неопределено,Объект.ТекстЗапроса,ТекстЗапроса)) Тогда
			
			Возврат "Не указан текст запроса";
			
		КонецЕсли;
		
		Если ПустаяСтрока(Объект.ЗначениеПоказателя) Тогда
			
			Возврат "Не заполнено значение показателя";
			
		КонецЕсли;
		
		Построитель=Новый ПостроительОтчета;
		
		Попытка
			Построитель.Текст = ?(ТекстЗапроса = Неопределено,Объект.ТекстЗапроса,ТекстЗапроса);
			
			Для Каждого ТекСтр из Объект.Параметры Цикл
				
				Если ТекСтр.ЭтоВыражение Тогда
					
					Выполнить("Построитель.Параметры.Вставить("""+ТекСтр.ИмяПараметра+""","+ТекСтр.ЗначениеПараметра+")");
					
				Иначе
					
					Если ТекСтр.ИмяПараметра="КонецПериода" Тогда
						
						Построитель.Параметры.Вставить(ТекСтр.ИмяПараметра,КонецДня(ТекСтр.ЗначениеПараметра));
						
					Иначе
						
						Построитель.Параметры.Вставить(ТекСтр.ИмяПараметра,ТекСтр.ЗначениеПараметра);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			Построитель.Выполнить();
			//ТаблицаМодуля=Построитель.Результат.Выгрузить();
			
			Рез=Построитель.Результат.Выгрузить();
			Таб=Новый ТабличныйДокумент;
			Построитель.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
			Построитель.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
			Построитель.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
			//Построитель.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Классика);
			Построитель.Вывести(Таб);

			РЗначение = Таб;//ТаблицаМодуля.Итог(Объект.ЗначениеПоказателя);
			
		Исключение
		   Возврат	ОписаниеОшибки(); 
		КонецПопытки;
	Иначе
		
		Если ПустаяСтрока(Объект.ПроизвольныйМодуль) Тогда
			
			Возврат "Не указан текст запроса";
			
		КонецЕсли;  
		
		Если ПустаяСтрока(Объект.ЗначениеПоказателя) Тогда
			
			Возврат "Не заполнено значение показателя";
			
		КонецЕсли;
		
		Попытка
			НачПериода="";
			КонПериода="";
			Организация="";
			СтрокаПараметров="";
			Сч=0;         
			Для Каждого ТекПараметр Из Объект.Параметры Цикл 
				
				Строка = ТекПараметр.ИмяПараметра + "=" + ?(ТекПараметр.ЭтоВыражение,ТекПараметр.ЗначениеПараметра,"Параметры[" + Сч + "].ЗначениеПараметра")+";";
				СтрокаПараметров = СтрокаПараметров + Строка + Символы.ПС;
				Сч=Сч+1; 
				
			КонецЦикла;   
			//выполним модуль
			ТаблицаМодуля=Неопределено;
			Выполнить(СтрокаПараметров+Объект.ПроизвольныйМодуль);
			РЗначение = ТаблицаМодуля.Итог(Объект.ЗначениеПоказателя);
	
		Исключение
		   Возврат	ОписаниеОшибки(); 
		КонецПопытки;
	КонецЕсли;       
	
	
	ВремяКонцаВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ВремяВыполненияВМиллисекундах = ВремяКонцаВыполнения - ВремяНачала;
	Сообщить("ВремяВыполненияВМиллисекундах: "+ВремяВыполненияВМиллисекундах);
	
	Возврат РЗначение;
КонецФункции

Процедура ВыгрузитьДанные(Com, Показатели, Очистить = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_Показатели.Ссылка КАК Ссылка,
		|	БТ_Показатели.ID КАК ID
		|ИЗ
		|	Справочник.БТ_Показатели КАК БТ_Показатели
		|ГДЕ
		|	БТ_Показатели.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Показатели);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МетПоказателей = Метаданные.Справочники.БТ_Показатели;
	
	СписокРеквизитовПропуска = Новый СписокЗначений;
	СписокРеквизитовПропуска.Добавить("Код");
	СписокРеквизитовПропуска.Добавить("Автор");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Показатель = ВыборкаДетальныеЗаписи.Ссылка;
		
		ПоказательCom = Com.Справочники.БТ_Показатели.НайтиПоРеквизиту("ID", ВыборкаДетальныеЗаписи.ID);
		
		Если ПоказательCom.Пустая() Тогда
			
			ОБПоказатель = Com.Справочники.БТ_Показатели.СоздатьЭлемент();
			
		Иначе
			
			ОБПоказатель = ПоказательCom.ПолучитьОбъект();
			
		КонецЕсли; 

		Для каждого ТекРеквизит Из МетПоказателей.Реквизиты Цикл
			
			Если не СписокРеквизитовПропуска.НайтиПоЗначению(ТекРеквизит.Имя) = Неопределено или ОБПоказатель[ТекРеквизит.Имя] = Показатель[ТекРеквизит.Имя] Тогда
				
				Продолжить;
				
			КонецЕсли;     
			
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Показатель[ТекРеквизит.Имя]));
				
			Если не ОбъектМетаданных = Неопределено  и Метаданные.Перечисления.Содержит(ОбъектМетаданных)  Тогда	
				
				ЗначениеПеречисления = XMLСтрока(Показатель[ТекРеквизит.Имя]);
				ОБПоказатель[ТекРеквизит.Имя] = Com.Перечисления[ОбъектМетаданных.имя][ЗначениеПеречисления];

			ИначеЕсли не ОбъектМетаданных = Неопределено  и Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
				
				ОБПоказатель[ТекРеквизит.Имя] = Com.Справочники[ОбъектМетаданных.имя].НайтиПоНаименованию(ТекРеквизит.Имя);
				
			Иначе
				
				ОБПоказатель[ТекРеквизит.Имя] = Показатель[ТекРеквизит.Имя];   
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого ТекСтр из Показатель.Параметры Цикл
			
			Нстр = ОБПоказатель.Параметры.Найти(ТекСтр.ИмяПараметра, "ИмяПараметра");
			
			Если НСтр = Неопределено Тогда
				
				НовСтр = ОБПоказатель.Параметры.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
				
			КонецЕсли;
								
		КонецЦикла;
		
		Если не ОБПоказатель.Наименование = Показатель.Наименование Тогда
			
			ОБПоказатель.Наименование = Показатель.Наименование;
			
		КонецЕсли;
		
		Попытка
			
			ОБПоказатель.Записать();  
			
			Если Очистить Тогда
				
				Значения = Com.РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьНаборЗаписей();
				Значения.Отбор.Показатель.Установить(ОБПоказатель.Ссылка);
				Значения.Отбор.План.Установить(Ложь);
				Значения.Записать();
				
			КонецЕсли;
			
		Исключение
			
			Сообщить("Ошибка при трансляции показателя:" + Показатель);
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыгрузитьПоказатели(Показатели, Очистить = Ложь) Экспорт
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК ПутьКБазе
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""БазыДляСинхронизацииПоказателей""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Com = БТ_СлужебныеФункции.ПолучитьКомКоннектор().Connect(ВыборкаДетальныеЗаписи.ПутьКБазе);

		ВыгрузитьДанные(Com, Показатели, Очистить);
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	
КонецФункции
